
#Nombre: Nelson Steven Sanabio Maldonado


##Respuesta a)

> El error es la indexación que empieza desde -1, esto es incorrecto la manera correcta es la siguiente
mtcars[1:4,]

> Notamos de que mtcars es un data.frame es decir un conjunto de lista, esta bien el comando pero solamente le falta la coma 
mtcars[mtcars$cyl <= 5 ,]

> Como podemos ver dentro del mtcars que es una condicional, sin embargo, para que sea correcto el código se debe hacer tambien para el número 6
mtcars[mtcars\$cyl==4 | mtcars\$cyl==6,]


##Respuesta b)
> Como sabemos NA no es afectado por ningún otro numero o condición, pues como creamos un vector de 1:5 y luego le indexamos NA al vector, modificará todo el número dentro del vector y lo cambiara todo por NA.

##Respuesta c)
> Como se mencionó anteriormente mtcar es un data.frame entonces si nosotros corremos el comando mtcar[1:20] nos saldrá un error debido a que no existe las columnas que no estan definidas en mtcar, un ejemplo seria de que mtcar tenga una lista a y b donde a = primera columna y b = segunda columna, en este caso 18 columnas no están en mtcars es por eso que no sale error

##Respuesta d)
> Funciona de la siguiente manera:  
Cuando en el df no existe NA  
>is.na es un booleano, verifica si dentro del df existe NA, en nuestra suposición no existe por lo tanto es FALSO entonces luego irá al dataframe df[FALSE] pero no hará nada por que no encontró NA y la asignación se dará pero no modificará   
Cuando en el df si existe NA  
>Verifica si dentro del df hay NA, si lo hay es TRUE lo buscará en df y como le estamos asignando 0 , en el data.frame todos los que son NA se cambiarán a 0


